"""
Данные о проекте "Объединяем компетенции"
"""

# Текст о проекте
PROJECT_DESCRIPTION = """Конференция «Объединяем компетенции» — профессиональная площадка для врачей, где совместная работа специалистов разных направлений превращается в реальные результаты для пациентов.

Для кого: гинекологи, эндокринологи, андрологи, терапевты, хирурги (а также все, кто вовлечён в ведение пациенток на пути к материнству).

Мы собираемся для:
● обмена знаниями;
● разбора клинических случаев и обсуждения практических решений;
● укрепления междисциплинарного взаимодействия;
● выстраивания эффективной маршрутизации пациентов.

Наш проект существует с сентября 2025 года. После проведения двух конференций мы уже активно сотрудничаем с коллегами и видим реальные результаты: многие пациентки прошли этап криоконсервации яйцеклеток, и у некоторых уже наступила долгожданная беременность благодаря правильно выстроенной совместной тактике.

Объединив наши компетенции, мы можем больше!"""

# Приветственное сообщение
WELCOME_MESSAGE = """Уважаемый коллега! Приветствуем вас на проекте "Объединяем компетенции".

Здесь вы можете узнать все о цели и миссии нашего проекта, посмотреть видео с предыдущих мероприятий, познакомиться с нашим телеграм-каналом, в котором мы делимся всей самой актуальной информацией из мира репродуктивной медицины, а также зарегистрироваться на нашу весеннюю конференцию "Объединяем компетенции - искусство криоконсервации".

Мы - не такие как все. "Вместе к высоким результатам"."""

# Сообщение после регистрации
REGISTRATION_SUCCESS_MESSAGE = """Поздравляем! Вы успешно зарегистрировались на конференцию "Объединяем компетенции".

Подписывайтесь на <a href="https://t.me/partnerroyal">канал</a>, чтобы получать актуальные новости о мероприятии и полезные материалы. До встречи на конференции!"""

# Ссылки
CHANNEL_PARTNERROYAL_URL = "https://t.me/partnerroyal"
ROYAL_CLINIC_SITE_URL = "https://royalclinicmoscow.ru/?ysclid=mltc5eh8ty205122993"
ROYAL_CLINIC_CHANNEL_URL = "https://t.me/royalclinicmos"

# Video IDs для архива прошедших мероприятий (2 видео)
ARCHIVE_VIDEOS = [
    "BAACAgIAAxkBAAMHaZmTX0EghXQYhmpwq-M1U5O-n50AAiiYAAKfH9FIgY-9rAVup2I6BA",  # TODO: Добавить video_id первого видео
    "BAACAgIAAxkBAAMLaZmTvzXkqwGXlX-bEMEO1HEvF-YAAimYAAKfH9FIziXPRTWWYyA6BA",  # TODO: Добавить video_id второго видео
]

# Video IDs для отзывов участников (2 видео)
REVIEWS_VIDEOS = [
    "BAACAgIAAxkBAAMbaZmWeJFyhwJIwjuZoBHMGPTDDQkAAkWYAAKfH9FIwu0QmAEPly46BA",  # TODO: Добавить video_id первого видео
    "BAACAgIAAxkBAAMfaZmXaMfe6xy2lJAev8jE2gIoPuEAAkuYAAKfH9FIoZgDAAH510kkOgQ",  # TODO: Добавить video_id второго видео
]

